In [19]:
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split

In [20]:
df = pd.read_csv('train.csv',usecols=['Age','Fare','Survived'])

In [21]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [22]:
df.isnull().mean() * 100

Survived     0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [23]:
X = df.drop(columns=['Survived'])
y = df['Survived']

In [24]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [25]:
X_train

      Age      Fare
30   40.0   27.7208
10    4.0   16.7000
873  47.0    9.0000
182   9.0   31.3875
876  20.0    9.8458
..    ...       ...
534  30.0    8.6625
584   NaN    8.7125
493  71.0   49.5042
527   NaN  221.7792
168   NaN   25.9250

[712 rows x 2 columns]

In [26]:
X_train['Age_imputed'] = X_train['Age']
X_test['Age_imputed'] = X_test['Age']

In [27]:
X_test.tail()

      Age     Fare  Age_imputed
89   24.0   8.0500         24.0
80   22.0   9.0000         22.0
846   NaN  69.5500          NaN
870  26.0   7.8958         26.0
251  29.0  10.4625         29.0

In [28]:
no_of_age_missing_in_train = X_train['Age'].isnull().sum()
no_of_age_missing_in_test = X_test['Age'].isnull().sum()

### X_train['Age_imputed'][X_train['Age_imputed'].isnull()] only those rows which contain missing values

In [29]:
X_train['Age_imputed'][X_train['Age_imputed'].isnull()] = X_train['Age'].dropna().sample(no_of_age_missing_in_train).values
X_test['Age_imputed'][X_test['Age_imputed'].isnull()] = X_train['Age'].dropna().sample(no_of_age_missing_in_test).values

In [30]:
X_train['Age'].dropna().sample(no_of_age_missing_in_train).values

array([32.5 , 39.  , 37.  , 39.  , 32.5 , 41.  , 26.  , 25.  , 19.  ,
       21.  , 44.  , 36.5 , 35.  , 36.  ,  2.  , 29.  ,  0.75, 17.  ,
       23.5 , 40.  , 40.  , 50.  , 23.  , 48.  , 20.  , 32.  , 22.  ,
       24.  , 19.  , 44.  , 39.  , 27.  , 33.  , 14.5 , 59.  , 50.  ,
       33.  , 22.  , 37.  , 43.  , 44.  , 31.  , 38.  , 27.  , 34.  ,
       28.  , 18.  , 13.  , 32.  , 24.  , 65.  , 61.  , 37.  ,  7.  ,
       23.  , 26.  , 28.  ,  4.  ,  2.  , 24.  , 21.  , 25.  , 61.  ,
        9.  , 30.5 , 19.  , 30.  , 30.  , 31.  , 40.5 , 30.  , 31.  ,
       19.  , 15.  , 32.  , 29.  , 28.  , 40.5 , 42.  , 16.  , 26.  ,
       35.  , 40.  , 48.  , 24.  , 35.  , 16.  , 36.  , 22.  , 58.  ,
       24.  , 22.  , 12.  , 24.  , 26.  , 30.  , 30.  , 38.  , 22.  ,
       33.  , 21.  , 49.  , 58.  , 27.  , 47.  , 28.  , 19.  , 17.  ,
       39.  , 16.  , 27.  , 49.  , 52.  , 31.  ,  8.  , 32.  , 26.  ,
       19.  , 30.  , 27.  , 30.  , 24.  , 18.  , 25.  ,  7.  ,  9.  ,
       31.  ,  1.  , 45.5 , 52.  , 45.  , 19.  , 48.  , 37.  , 32.  ,
       14.  ,  5.  , 21.  , 46.  , 36.  , 70.  , 35.  , 35.  , 30.  ,
       70.5 , 33.  , 43.  , 28.  ])

In [31]:
X_train['Age'].isnull().sum()

148

In [32]:
X_train

      Age      Fare  Age_imputed
30   40.0   27.7208         40.0
10    4.0   16.7000          4.0
873  47.0    9.0000         47.0
182   9.0   31.3875          9.0
876  20.0    9.8458         20.0
..    ...       ...          ...
534  30.0    8.6625         30.0
584   NaN    8.7125         18.0
493  71.0   49.5042         71.0
527   NaN  221.7792         66.0
168   NaN   25.9250         25.0

[712 rows x 3 columns]

In [33]:
print('Original variable variance: ', X_train['Age'].var())
print('Variance after random imputation: ', X_train['Age_imputed'].var())

Original variable variance:  204.3495133904614
Variance after random imputation:  208.00795646087158

In [34]:
X_train[['Fare', 'Age', 'Age_imputed']].cov()

                    Fare         Age  Age_imputed
Fare         2368.246832   71.512440    72.856970
Age            71.512440  204.349513   204.349513
Age_imputed    72.856970  204.349513   208.007956

In [38]:
data = pd.read_csv('house-train.csv',usecols=['GarageQual','FireplaceQu', 'SalePrice'])

In [39]:
data.head()

  FireplaceQu GarageQual  SalePrice
0         NaN         TA     208500
1          TA         TA     181500
2          TA         TA     223500
3          Gd         TA     140000
4          TA         TA     250000

In [40]:
data.isnull().mean() * 100

FireplaceQu    47.260274
GarageQual      5.547945
SalePrice       0.000000
dtype: float64

In [46]:
X = data.drop(columns=['SalePrice'])
y = data['SalePrice']

In [47]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [48]:
X_train['GarageQual_imputed'] = X_train['GarageQual']
X_test['GarageQual_imputed'] = X_test['GarageQual']

X_train['FireplaceQu_imputed'] = X_train['FireplaceQu']
X_test['FireplaceQu_imputed'] = X_test['FireplaceQu']

In [49]:
X_train.sample(5)

     FireplaceQu GarageQual GarageQual_imputed FireplaceQu_imputed
566           Gd         TA                 TA                  Gd
742          NaN         TA                 TA                 NaN
786          NaN         TA                 TA                 NaN
1163         NaN         Fa                 Fa                 NaN
713          NaN         TA                 TA                 NaN

In [50]:
X_train['GarageQual_imputed'][X_train['GarageQual_imputed'].isnull()] = X_train['GarageQual'].dropna().sample(X_train['GarageQual'].isnull().sum()).values
X_test['GarageQual_imputed'][X_test['GarageQual_imputed'].isnull()] = X_train['GarageQual'].dropna().sample(X_test['GarageQual'].isnull().sum()).values

X_train['FireplaceQu_imputed'][X_train['FireplaceQu_imputed'].isnull()] = X_train['FireplaceQu'].dropna().sample(X_train['FireplaceQu'].isnull().sum()).values
X_test['FireplaceQu_imputed'][X_test['FireplaceQu_imputed'].isnull()] = X_train['FireplaceQu'].dropna().sample(X_test['FireplaceQu'].isnull().sum()).values

In [51]:
X_train['FireplaceQu_imputed'].isnull().sum()

0